export const BASE_INITIAL_TARGET_CHARS: readonly string[] = [
  'ᄀ', 'ᄁ', 'ᄂ', 'ᄔ', 'ᄃ', 'ᄄ', 'ᄅ', 'ᄙ', 'ᄆ', 'ᄇ', 'ᄈ', 'ᄢ', 'ᄉ', 'ᄊ',
  'ᄼ', 'ᄽ', 'ᄾ', 'ᄿ', 'ᄋ', 'ᅌ', 'ᅇ', 'ᄌ', 'ᄍ', 'ᅎ', 'ᅏ', 'ᅐ', 'ᅑ', 'ᅀ',
  'ᄎ', 'ᅔ', 'ᅕ', 'ᄏ', 'ᄐ', 'ꥹ', 'ᄑ', 'ᄒ', 'ᅘ', 'ᅙ', 'ꥼ', 'ᅟ',
] as const

export const BASE_MEDIAL_TARGET_CHARS: readonly string[] = [
  'ᅡ', 'ᅢ', 'ᅣ', 'ᅤ', 'ᅥ', 'ᅦ', 'ᅧ', 'ᅨ', 'ᅩ', 'ᅪ', 'ᅫ', 'ᅬ', 'ᅭ', 'ᅮ',
  'ᅯ', 'ᅰ', 'ᅱ', 'ᅲ', 'ᅳ', 'ᅴ', 'ᅵ', 'ᆞ', 'ᆢ', 'ᆂ', 'ᆍ', 'ᆖ', 'ퟄ', 'ᆎ',
  'ᆙ', 'ᅠ',
] as const

export const BASE_FINAL_TARGET_CHARS: readonly string[] = [
  'ᆨ', 'ᆩ', 'ᆪ', 'ᆫ', 'ᆬ', 'ᆭ', 'ᆮ', 'ᆯ', 'ᆰ', 'ᆱ', 'ᆲ', 'ᆳ', 'ᆴ', 'ᆵ',
  'ᆶ', 'ᆷ', 'ퟠ', 'ᆸ', 'ᆹ', 'ᆺ', 'ᆻ', 'ᆼ', 'ᆽ', 'ᆾ', 'ᆿ', 'ᇀ', 'ᇁ', 'ᇂ',
] as const
